Revit 2027 API
NumberingSchema.GetFormatting Method
 Get the configuration for formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberingFormatSettings GetFormatting()
Public Function GetFormatting As NumberingFormatSettings
public:
NumberingFormatSettings^ GetFormatting()
member GetFormatting : unit -> NumberingFormatSettings
Return Value
NumberingFormatSettings
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace